app/controllers/todo_items_controller.rb

INSERT INTO `todo_items` (`content`, `todo_list_id`, `created_at`, `updated_at`) VALUES ('', 2, '2016-07-21 07:13:19', '2016-07-21 07:13:19')
---
	def create
		@todo_item = @todo_list.todo_items.create(todo_item_params)

DELETE FROM `todo_items` WHERE `todo_items`.`id` = 1
---
	def destroy
		if @todo_item.destroy

UPDATE `todo_items` SET `completed_at` = '2016-07-21 07:15:57', `updated_at` = '2016-07-21 07:15:57' WHERE `todo_items`.`id` = 2
---
	def complete
		@todo_item.update_attribute(:completed_at, Time.now)

SELECT  `todo_lists`.* FROM `todo_lists` WHERE `todo_lists`.`id` = 2 LIMIT 1
---
	def set_todo_list
		@todo_list = TodoList.find(params[:todo_list_id])

SELECT  `todo_items`.* FROM `todo_items` WHERE `todo_items`.`todo_list_id` = 2 AND `todo_items`.`id` = 2 LIMIT 1
---
	def set_todo_item
		@todo_item = @todo_list.todo_items.find(params[:id])