app/controllers/todo_lists_controller.rb

SELECT COUNT(*) FROM `todo_lists`
SELECT `todo_lists`.* FROM `todo_lists`
---
  def index
    # @todo_lists = TodoList.all
    @todo_lists = TodoList.page(params[:page]).per(3)

INSERT INTO `todo_lists` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Intelligence Returns', '1. Package Issues.\r\n2. All Sites order.\r\n3. Project, Event, Order ID Editable Field.\r\n4. Screen Should scroll up when you return an item in the bottom.\r\n5. Unreturn issues need to be fixed.\r\n6. Update Asset Current Site', '2016-07-21 07:11:50', '2016-07-21 07:11:50')
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE `todo_lists` SET `title` = 'Intelligence Returns', `description` = '', `updated_at` = '2016-07-21 07:14:20' WHERE `todo_lists`.`id` = 2
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

DELETE FROM `todo_lists` WHERE `todo_lists`.`id` = 1
---
  def destroy
    @todo_list.destroy

SELECT  `todo_lists`.* FROM `todo_lists` WHERE `todo_lists`.`id` = 2 LIMIT 1
---
    def set_todo_list
      @todo_list = TodoList.find_by_id(params[:id])